In [2]:
import pandas as pd

In [3]:
df=pd.read_csv('https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv')

In [4]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [5]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [7]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [8]:
type(df.dtypes)

pandas.core.series.Series

# Series is somewhat similiar to lists...We can person slicing and most of the operations

In [9]:
df['Survived']

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [10]:
df['Survived'][::-1]

890    0
889    1
888    0
887    1
886    0
      ..
4      0
3      1
2      1
1      1
0      0
Name: Survived, Length: 891, dtype: int64

In [11]:
df['Survived'][10]

1

# In series we cannot access values using NEGATIVE INDEXING

In [12]:

df['Survived'][-5]

KeyError: -5

In [13]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [14]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [15]:
df.dtypes=='object'

PassengerId    False
Survived       False
Pclass         False
Name            True
Sex             True
Age            False
SibSp          False
Parch          False
Ticket          True
Fare           False
Cabin           True
Embarked        True
dtype: bool

In [16]:
df.dtypes[df.dtypes=='object']

Name        object
Sex         object
Ticket      object
Cabin       object
Embarked    object
dtype: object

In [17]:
df.dtypes[df.dtypes=='object'].index

Index(['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked'], dtype='object')

In [18]:
# Displays the columns and data values of a categorical type
df[df.dtypes[df.dtypes=='object'].index]

,Name,Sex,Ticket,Cabin,Embarked
0,"Braund, Mr. Owen Harris",male,A/5 21171,NaN,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,PC 17599,C85,C
2,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,NaN,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,113803,C123,S
4,"Allen, Mr. William Henry",male,373450,NaN,S
...,...,...,...,...,...
886,"Montvila, Rev. Juozas",male,211536,NaN,S
887,"Graham, Miss. Margaret Edith",female,112053,B42,S
888,"Johnston, Miss. Catherine Helen ""Carrie""",female,W./C. 6607,NaN,S
889,"Behr, Mr. Karl Howell",male,111369,C148,C
890,"Dooley, Mr. Patrick",male,370376,NaN,Q

In [19]:
Categorical=df[df.dtypes[df.dtypes=='object'].index]

In [20]:
Categorical.describe()

                           Name   Sex  Ticket    Cabin Embarked
count                       891   891     891      204      889
unique                      891     2     681      147        3
top     Braund, Mr. Owen Harris  male  347082  B96 B98        S
freq                          1   577       7        4      644

In [ ]:
df

In [ ]:
df['Name']

In [ ]:
# Try to access more than one column
df['Name','Fare']

In [ ]:
df[['Name','Fare']]

In [ ]:
type(df[['Name','Fare']])

In [ ]:
df['Age'].isnull()==True

In [ ]:
import numpy as np

In [ ]:
np.where(df['Age'].isnull()==True)
# This will fetch the list of indexes of null values

In [ ]:
df[df['Age'].isnull()==True]

# Using iloc----> Integer location

* Using iloc we can extract data row wise

In [ ]:
df['Age'].isnull()

In [ ]:
df['Age'].isnull()==True

In [ ]:
import numpy as np
np.where(df['Age']==True)

In [ ]:
np.where(df['Age'].isnull()==True)

In [ ]:
df.iloc[np.where(df['Age'].isnull()==True)]

In [ ]:
df.iloc[5]

In [ ]:
df

In [ ]:
df.iloc[[1,2,3,4,5,6]]

# Get the name of person who has paid highest fare

In [ ]:
df['Fare']

In [ ]:
max(df['Fare'])

In [ ]:
df['Fare']==max(df['Fare'])

In [ ]:
df[df['Fare']==max(df['Fare'])]

In [ ]:
df[df['Fare']==max(df['Fare'])].Name

# Another way of doing the same requirement

In [ ]:
np.where(df['Fare']==max(df['Fare']))

# Another requirement:: Get the name of person whose age=35

In [ ]:
df

In [ ]:
df=pd.read_csv('https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv')

In [ ]:
df

In [ ]:
df['Age']==35.0

In [ ]:
df[df['Age']==35.0]

In [ ]:
[df[df['Age']==35.0].Name]

In [ ]:
df[df['Age']==35.0].Name

In [ ]:
df[df['Age']==35.0].index

# Get the age of person whose cabin is "Nan"

In [ ]:
df

In [ ]:
df['Cabin']

In [ ]:
df['Cabin'].isnull()

In [ ]:
df[df['Cabin'].isnull()]

In [ ]:
df[df['Cabin'].isnull()].Age

In [ ]:
df[['Age','Cabin']][df['Cabin'].isnull()]

In [ ]:
df

# Requirement: How many male passengers survived

In [21]:
df['Sex']

0        male
1      female
2      female
3      female
4        male
        ...
886      male
887    female
888    female
889      male
890      male
Name: Sex, Length: 891, dtype: object

In [22]:
df['Sex']=='male'

0       True
1      False
2      False
3      False
4       True
       ...
886     True
887    False
888    False
889     True
890     True
Name: Sex, Length: 891, dtype: bool

In [23]:
df[df['Sex']=='male']

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [24]:
male_survived=df[df['Sex']=='male'].Survived

In [25]:
male_survived

0      0
4      0
5      0
6      0
7      0
      ..
883    0
884    0
886    0
889    1
890    0
Name: Survived, Length: 577, dtype: int64

In [26]:
df[['Name']][df[male_survived]]

KeyError: "None of [Int64Index([0, 0, 0, 0, 0, 0, 0, 0, 1, 0,\n            ...\n            0, 0, 0, 0, 0, 0, 0, 0, 1, 0],\n           dtype='int64', length=577)] are in the [columns]"

In [27]:
df.Name

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [ ]:
df["Name"]

In [ ]:
((df.Survived==1) & ( df.Sex=='Male'))

In [ ]:
df["Name"][((df.Survived==1) & ( df.Sex=='male'))]

In [ ]:
df

In [ ]:
df["Name"]

In [ ]:
[((df.Survived==1) & ( df.Sex=='male'))]

In [ ]:
df["Name"][((df.Survived==1) & ( df.Sex=='male'))]

# How to generate a random numbers::

In [ ]:
import numpy as np

In [ ]:
np.random.rand(4,3)

In [ ]:
Random_numbers_generation=np.random.rand(10,10)

In [ ]:
Random_numbers_generation

# Difference between iloc and loc::

* Loc :: It is a label based data selecting method

In [ ]:
import pandas as pd

In [ ]:
df11=pd.read_csv('https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv')

In [ ]:
df11

# LOC:: It is a label based selection

In [ ]:
df11.loc[3,'PassengerId']

In [ ]:
df11.loc[3]

In [ ]:
df11.loc[0:4,'Name']

In [ ]:
df11.loc[0:4,'Name','Fare']

# USE LISTS TO GET RID OF ABOVE ERROR

In [ ]:
df11.loc[0:4,['Name','Fare']]

## Slicing using labels

In [ ]:
df11.loc[0:4,'Name':'Fare']

In [ ]:
df11

In [ ]:
df11.loc[0:4,'PassengerId':'Embarked']

# iloc::

* It is completely an index based selection

In [ ]:
# Will ge error
df11.iloc[0:4,'PassengerId':'Embarked']

In [ ]:
df11.iloc[0:4,0:]

In [ ]:
df11.iloc[0:4,1:5]

In [ ]:
df11.iloc[0:4]

In [ ]:
df11.iloc[0:4,0:2:2]

# Another difference between loc and iloc

* Here df.loc[0:4]=====> The last index (4) will be considered in loc

* Here df.iloc[0:4]====> The last index (4) will not be considerded in iloc

In [ ]:
df11.loc[0:4] 
# The last index 4 is considered

In [ ]:
df11.iloc[0:4]
# The last index is not considered

In [ ]:
# I want only the PassengerId and Fare of all passengers
df11.iloc[0:,[0,9]]

In [ ]:
# I want only the PassengerId and Fare of first 5 passengers
df11.iloc[0:5,[0,9]]

In [ ]:
type(df11.iloc[0:5,[0,9]])

# How to make a dataset using random numbers::

In [ ]:
np.random.randint(3,6,(5,4))
# Here 3,6---to get the values between 3 to 6
# Here (5,4)--mean 5 rows and 4 columns

In [ ]:
df123=pd.DataFrame(np.random.randint(3,6,(5,4)))

In [ ]:
df123

In [ ]:
pd.DataFrame(np.random.randint(0,50,(50,6)))

# How to give my own row name and column name

In [ ]:
pd.DataFrame(np.random.randint(0,50,(5,5)))

In [ ]:
df222=pd.DataFrame(np.random.randint(0,50,(5,5)),index=['A','B','C','D','E'],columns=['Roll','Id','Reg','Tag','Govt'])

In [ ]:
df222

In [ ]:
df222.describe()

In [ ]:
df222

In [ ]:
df222.loc[['D','E'],'Reg':'Tag']

In [ ]:
df222.loc[['D','E']][['Reg','Tag']]

In [ ]:
df2=pd.DataFrame(np.random.randint(0,50,(5,5)),columns=['Roll','Id','Reg','Tag','Govt'])

In [ ]:
df2

In [ ]:
df2.iloc[1:3]

In [ ]:
#df11.iloc[0:5,[0,9]]
df2.iloc[1:3,[2,3,4]]

In [ ]:
df222=pd.DataFrame(np.random.randint(0,50,(5,5)),index=['A','B','C','D','E'],columns=['Roll','Id','Reg','Tag','Govt'])

In [ ]:
df222

In [ ]:
df222.loc['C':'E']

In [ ]:
df222.loc['C':'E'][['Reg','Tag','Govt']]

In [ ]:
df222.loc[['C','D'],['Roll','Id']]

# Creating a dataframe using DICTIONARY